import sys
sys.stdin = open("input (3).txt", "r")

T = int(input())
# 여러개의 테스트 케이스가 주어지므로, 각각을 처리합니다.
for test_case in range(1, T + 1):
    
    N = int(input())

    c_50000 = N // 50000
    m_50000 = N % 50000

    c_10000 = m_50000 // 10000
    m_10000 = m_50000 % 10000

    c_5000 = m_10000 // 5000
    m_5000 = m_10000 % 5000

    c_1000 = m_5000 // 1000
    m_1000 = m_5000 % 1000

    c_500 = m_1000 // 500
    m_500 = m_1000 % 500

    c_100 = m_500 // 100
    m_100 = m_500 % 100

    c_50 = m_100 // 50
    m_50 = m_100 % 50

    c_10 = m_50 // 10
    m_10 = m_50 % 10

    print(f'#{test_case}\n{c_50000} {c_10000} {c_5000} {c_1000} {c_500} {c_100} {c_50} {c_10}')